
#include <MyIncludes_H.h>


////////////////////////////////////////////////////////////////////////////////
// 功能描述 :  20个NOP延时
// 输入参数 : 无
// 返回参数 : 无
// 说明     : 
////////////////////////////////////////////////////////////////////////////////

void HOLD_SPI_CLK (void)
{
   Lib_Delay_Nop(4);
}



////////////////////////////////////////////////////////////////////////////////
// 功能描述 : RF初始化IO口
// 输入参数 : 无
// 返回参数 : 无
// 说明     : 
////////////////////////////////////////////////////////////////////////////////
void SX1276InitIo( void )
{
 //   PA_TX_DIR = 1;           //PA_TX 作为输出
 //   PA_RX_DIR = 1;           //PA_RX 作为输出
 //   PA_RX_OUT = 0;           //PA_RX 初始化输出为0
 //   PA_TX_OUT = 1;           //PA_TX 初始化输出为1
 //   SXRESET_SET = 1;
	 LORA_RF_SPI_INITLIZE();
}
////////////////////////////////////////////////////////////////////////////////
// 功能描述 : RF  SPI设置初始化
// 输入参数 : 无
// 返回参数 : 无
// 说明     : 此初始化为430硬件SPI初始化
////////////////////////////////////////////////////////////////////////////////
void SX1276SPISetup(void)
{
    SPI_D0_HIGH();
    SPI_CLK_LOW();
    SPI_DI_Enable() ;
    SPI_CS_HIGH();
}
////////////////////////////////////////////////////////////////////////////////
// 功能描述 : RF   复位
// 输入参数 : 无
// 返回参数 : 无
// 说明     :
////////////////////////////////////////////////////////////////////////////////
void SX1276Reset()
{
    LSD_RF_SXRESET_LOW()  ;   //复位引脚输出低电平
    Lib_Delay_ms(1);
    LSD_RF_SXRESET_HIGH() ;  //复位引脚输出高电平
    Lib_Delay_ms(15);
}


//**********************************************************************************
// 功能描述 : spi发送or接收1字节
// 输入参数 : unsigned char mosi
// 返回参数 : unsigned char
// 说明     : 
//**********************************************************************************
unsigned char LSD_RF_SpiInOut (unsigned char mosi) 
{ 
    unsigned char i;
    unsigned char onebyte;
    onebyte = mosi;
    for(i = 8; i > 0; i--) 
    {
        HOLD_SPI_CLK();
        if(onebyte & 0x80) 
        {
    	   SPI_D0_HIGH();
        }
        else 
        {
    	   SPI_D0_LOW();

        }

        HOLD_SPI_CLK();
        SPI_CLK_HIGH();
	onebyte <<= 1;      // next bit
//	SPI_DI_Enable();
        if(SPI_DI_JUDGE) 
        {
            onebyte++;      // 1 found on MISO
        }
        HOLD_SPI_CLK();
        SPI_CLK_LOW();
	}
    return onebyte;         // mosi now becomes the value of miso
}


////////////////////////////////////////////////////////////////////////////////
// 功能描述 : RF  TX/RX的PA切换
// 输入参数 :  bool txEnable  切换逻辑
// 返回参数 : 无
// 说明     :真：作为TX。假：作为RX   为硬件两个PA控制IO口 LORA模块无效
////////////////////////////////////////////////////////////////////////////////
void SX1276WriteRxTx( BOOL txEnable )
{
    if( txEnable != 0 )       //如果为真，为TX
    {
     //   PA_RX_OUT = 0;        //PA_RX为0
    //    PA_TX_OUT = 1;        //PA_TX为1
    }
    else  //为假，为RX
    {
   //     PA_RX_OUT = 1;        //PA_RX为1
  //      PA_TX_OUT = 0;         //PA_TX为0
    }
}
////////////////////////////////////////////////////////////////////////////////



