/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name:				SYS_DATA_MACRO_H.H
**Author:			maji
**date:				2016-04-18
**description:		系统数据格式转换伪指令  （C51专用）
**note:				与MCU无关
**--------------------Version History -------------------------------------
** NO. Date         Ver      By         Description 
**==============================================================
** 1   2016-04-18   v01.00   sosomj     1. frist version                             
**
**==============================================================
*/


#ifndef 	_SYS_DATA_MACRO_H
#define	_SYS_DATA_MACRO_H


//******************************************************************
//			     	STANDARD BITS			 				//
//******************************************************************
#define BIT0                (0x01)
#define BIT1                (0x02)
#define BIT2                (0x04)
#define BIT3                (0x08)
#define BIT4                (0x10)
#define BIT5                (0x20)
#define BIT6                (0x40)
#define BIT7                (0x80)

//******************************************************************
//	数据格式转换       //
//******************************************************************

#define	     MAKEDWORD(v1,v2,v3,v4) (((Dword)(v1)<<24) + ((Dword)(v2)<<16) + ((Dword)(v3)<<8) + (Dword)(v4))
#define	     MAKEWORD(v1,v2)	       (((Word)(v1)<<8) + (Word)(v2))
#define	     HIBYTE(v1)		       ((Byte)((v1)>>8))
#define	     LOBYTE(v1)		       ((Byte)((v1)&0xff))
#define LongToBin(n) \
      (                    \
      ((n >> 21) & 0x80) | \
      ((n >> 18) & 0x40) | \
      ((n >> 15) & 0x20) | \
      ((n >> 12) & 0x10) | \
      ((n >>  9) & 0x08) | \
      ((n >>  6) & 0x04) | \
      ((n >>  3) & 0x02) | \
      ((n      ) & 0x01)   \
      )
#define       Bin(n)                 LongToBin(0x##n##l)   	//  2      进制转字节,如: Bin(11111111) = 0xff

//******************************************************************
//			     	布尔型数据结果定义	 				//
//******************************************************************
#ifndef TRUE
   #define TRUE  1
#endif

#ifndef FALSE
   #define FALSE 0
#endif

#ifndef HIGH
   #define HIGH  1
#endif

#ifndef LOW
   #define LOW 0
#endif


//******************************************************************
//	  取结构体内部元素的长度和偏移量伪指令		//
//******************************************************************
#define ST_MB_LEN(ST,MB) ((unsigned int)(sizeof(((ST *)0)->MB)))            //结构体成员的长度  //
#define ST_MB_OFFSET(ST,MB) (unsigned int)(&(((ST *)0)->MB))                //结构体成员的偏移地址  //


//******************************************************************
//     求一个数组的维度  //
//******************************************************************
#define dim(x) (sizeof(x)/sizeof(x[0]))    


/***************************************************************
*    END
****************************************************************/

#endif