/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name			: Lib_myLib_H.H
**Author		: maji
**date			: 2016-04-20 
**description	: 自主函数库程序相关模块声明文件集合
**note			: 通用型 C51适用
**--------------------Version History -------------------------------------
** NO. Date         Ver      By         Description 
**==============================================================
** 1   2016-04-20   v01.00   sosomj     1. frist version                             
**
**==============================================================
*/


#ifndef  _Lib_myLib_H
#define	    _Lib_myLib_H


/***********************************************************
*     声明文件引用
************************************************************/	

#include "Lib_mySpring_H.h"
#include "Lib_myTimer_H.h"
#include "Lib_myMath_H.h"





#endif
/***************************************************************
*    END
****************************************************************/

