/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name			: Proc_System_Check_H.H
**Author		: maji
**date			: 2016-04-20 
**description	: 系统主循环自检处理相关C代码的声明文件
**note			: V9811A ，MERTER FOR DL03C
**--------------------Version History -------------------------------------
** NO. Date         Ver      By         Description 
**==============================================================
** 1   2016-04-26   v01.00   sosomj     1. frist version                             
**
**==============================================================
*/




#ifndef _Proc_System_Check_H
#define _Proc_System_Check_H

/***************************************************************
*    1     立即数预定义   
****************************************************************/
//系统电源状态标识
#define SYS_RUN_FG_POWER_ON 		1
#define SYS_RUN_FG_POWER_OFF 		0

#define POWER_MODE_NORMAL   0         //=0 市电供应状态 //
#define POWER_MODE_BAT          1        //=1 电池供电运行状态 // 
#define POWER_MODE_PT            2        //=2 PT 供电状态 //   

/***************************************************************
*    2     数据结构声明     
****************************************************************/
typedef struct  
{
    uint8  tmr_openCover;     //开表上盖判断延时计数器 //
    uint8  tmr_closeCover;     //开表上盖判断延时计数器 //
    uint8  flg_openCover;       //开表上盖状态寄存器 //
    uint8  tmr_proKey;           //硬件校表延时计数器 //
    uint8  flg_proKey;       //硬件校表状态寄存器 //
}SYS_CKECK_VAR;

/***************************************************************
*    2     数据结构声明     
****************************************************************/
extern SYS_CKECK_VAR gs_sys_check_var;




/***************************************************************
*    3    变量声明       
****************************************************************/



/***************************************************************
*    4     函数声明        
****************************************************************/
extern void Proc_Check_System_Pre_Cycle(void);
extern void Proc_Check_PROKEY_Pre_sec(void);
extern void Proc_Check_COVER_Pre_sec(void);
extern void Proc_init_Check_var(void);
extern uint8 Check_LX_mode(void);

extern uint8 CheckPOWERUP(void);


/***************************************************************
*    5     其他内容，例如伪指令等       
****************************************************************/


/***************************************************************
*    END
****************************************************************/

#endif


